# GetValues Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable..::..GetValues Method
ExportFontTable Class See Also
---
Returns a collection of the values stored in this table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ExportFontInfo> GetValues()
```

Visual Basic
---
```text
Public Function GetValues As IList(Of ExportFontInfo)
```

Visual C++
---
```text
public:
IList<ExportFontInfo^>^ GetValues()
```

# ### Return Value
The collection of values.
# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace